yaswanth8872y/AURIX_code_examples/code_examples/iLLD_TC4D7_LK_ADS_QSPI_TLE9180D_2/Libraries/iLLD/TC4DA/CpuGeneric/_Impl/IfxClock_cfg.h
/**
 * \file IfxClock_cfg.h
 * \brief CLOCK on-chip implementation data 
 * \ingroup IfxLld_Clock 
 *
 * \version iLLD-TC4-v2.3.0
 * \copyright Copyright (c) 2025 Infineon Technologies AG. All rights reserved.
 *
 *
 *                                 IMPORTANT NOTICE
 *
 
 * Use of this file is subject to the terms of use agreed between (i) you or 
 * the company in which ordinary course of business you are acting and (ii) 
 * Infineon Technologies AG or its licensees. If and as long as no such 
 * terms of use are agreed, use of this file is subject to following:


 * Boost Software License - Version 1.0 - August 17th, 2003

 * Permission is hereby granted, free of charge, to any person or 
 * organization obtaining a copy of the software and accompanying 
 * documentation covered by this license (the "Software") to use, reproduce,
 * display, distribute, execute, and transmit the Software, and to prepare
 * derivative works of the Software, and to permit third-parties to whom the 
 * Software is furnished to do so, all subject to the following:

 * The copyright notices in the Software and this entire statement, including
 * the above license grant, this restriction and the following disclaimer, must
 * be included in all copies of the Software, in whole or in part, and all
 * derivative works of the Software, unless such copies or derivative works are
 * solely in the form of machine-executable object code generated by a source
 * language processor.

 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR 
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT
 * SHALL THE COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE 
 * FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 
 *
 * \defgroup IfxLld_Clock CLOCK
 * \ingroup IfxLld
 * \defgroup IfxLld_Clock_Impl Implementation
 * \ingroup IfxLld_Clock
 * \defgroup IfxLld_Clock_Std Standard Driver
 * \ingroup IfxLld_Clock
 */

#ifndef IFXCLOCK_CFG_H
#define IFXCLOCK_CFG_H 1

/******************************************************************************/
/*----------------------------------Includes----------------------------------*/
/******************************************************************************/
/******************************************************************************/
#include "Ifx_Cfg.h"
#include "IfxClock_bf.h"

/******************************************************************************/
/*                           Macro                                            */
/******************************************************************************/
#ifndef IFX_CFG_CLOCK_XTAL_FREQUENCY
#    define IFX_CFG_CLOCK_XTAL_FREQUENCY   20000000   /**< \brief Default External oscillator frequency */
#    warning "IFX_CFG_CLOCK_XTAL_FREQUENCY not specified in your IfxCfg.h file."
#    warning "Please double check the external XTAL frequency with the default setting of 20 MHz!"
#endif

#ifndef IFX_CFG_CLOCK_SYSCLK_FREQUENCY
#    define IFX_CFG_CLOCK_SYSCLK_FREQUENCY 20000000     /**< \brief Default External SysClk pin frequency */
#endif

#ifndef IFX_CFG_CLOCK_SYSPLL_FREQUENCY
#    define IFX_CFG_CLOCK_SYSPLL_FREQUENCY    500000000  /**< \brief Default PLL frequency */
#endif

#ifndef IFX_CFG_CLOCK_PPUPLL_FREQUENCY
#    define IFX_CFG_CLOCK_PPUPLL_FREQUENCY    450000000  /**< \brief Default PPU PLL frequency */
#endif

#ifndef IFX_CFG_CLOCK_PERPLL1_FREQUENCY
#    define IFX_CFG_CLOCK_PERPLL1_FREQUENCY   160000000   /**< \brief Default PER PLL1 frequency */
#endif

#ifndef IFX_CFG_CLOCK_PERPLL2_FREQUENCY
#    define IFX_CFG_CLOCK_PERPLL2_FREQUENCY   200000000   /**< \brief Default PER PLL2 frequency */
#endif

#ifndef IFX_CFG_CLOCK_PERPLL3_FREQUENCY
#    define IFX_CFG_CLOCK_PERPLL3_FREQUENCY   200000000   /**< \brief Default PER PLL3 frequency */
#endif

#define IFXCLOCK_EVR_OSC_FREQUENCY         (100000000.0f)

#ifndef IFX_CFG_CLOCK_OSC_F_FREQUENCY
#	 define IFXCLOCK_CFG_OSC_F_FREQ      20000000        /**< \brief Default fOsc_f low pass filtered oscillator frequency */
#endif

/* By Default - external crystal is chosen as input */
/* This can be set to external clock input by user */
#ifndef IFX_CFG_CLOCK_EXT_CLOCK
#    define IFX_CFG_CLOCK_EXT_CLOCK 0 /**< \brief Default External Crystal input */
#endif


/* iLLD Configs from Master CFG file */
/*Utility macros for the configuration structure */
#if (IFX_CFG_CLOCK_XTAL_FREQUENCY == (20000000))
#define IFXCLOCK_CFG_XTAL_FREQ        20MHZ
#elif (IFX_CFG_CLOCK_XTAL_FREQUENCY == (25000000))
#define IFXCLOCK_CFG_XTAL_FREQ        25MHZ
#elif (IFX_CFG_CLOCK_XTAL_FREQUENCY == (40000000))
#define IFXCLOCK_CFG_XTAL_FREQ        40MHZ
#elif (IFX_CFG_CLOCK_XTAL_FREQUENCY == (10000000))
#define IFXCLOCK_CFG_XTAL_FREQ        10MHZ
#elif (IFX_CFG_CLOCK_XTAL_FREQUENCY == (50000000))
#define IFXCLOCK_CFG_XTAL_FREQ        50MHZ
#else
#error "Wrong XTAL frequency configuration! check IFX_CFG_CLOCK_XTAL_FREQUENCY configuration in Ifx_Cfg.h."
#error "AurixPlus Triboard supported crystal frequencies are  10MHz, 20MHz, 25MHz 40MHz and 50MHz"
#endif

#if (IFX_CFG_CLOCK_SYSPLL_FREQUENCY == (80000000))
#define IFXCLOCK_CFG_SYSPLL_FREQ 80MHZ
#elif (IFX_CFG_CLOCK_SYSPLL_FREQUENCY == (133000000)) && (IFX_CFG_CLOCK_XTAL_FREQUENCY != (8000000))
#define IFXCLOCK_CFG_SYSPLL_FREQ 133MHZ
#elif (IFX_CFG_CLOCK_SYSPLL_FREQUENCY == (160000000))
#define IFXCLOCK_CFG_SYSPLL_FREQ 160MHZ
#elif (IFX_CFG_CLOCK_SYSPLL_FREQUENCY == (200000000))
#define IFXCLOCK_CFG_SYSPLL_FREQ 200MHZ
#elif (IFX_CFG_CLOCK_SYSPLL_FREQUENCY == (240000000))
#define IFXCLOCK_CFG_SYSPLL_FREQ 240MHZ
#elif (IFX_CFG_CLOCK_SYSPLL_FREQUENCY == (300000000))
#define IFXCLOCK_CFG_SYSPLL_FREQ 300MHZ
#elif (IFX_CFG_CLOCK_SYSPLL_FREQUENCY == (400000000))
#define IFXCLOCK_CFG_SYSPLL_FREQ 400MHZ
#elif (IFX_CFG_CLOCK_SYSPLL_FREQUENCY == (450000000))
#define IFXCLOCK_CFG_SYSPLL_FREQ 450MHZ
#elif (IFX_CFG_CLOCK_SYSPLL_FREQUENCY == (500000000))
#define IFXCLOCK_CFG_SYSPLL_FREQ 500MHZ
#else
#error "Wrong PLL frequency configuration!, check IFX_CFG_CLOCK_SYSPLL_FREQUENCY configuration in Ifx_Cfg.h."
#error "Supported PLL frequencies are 80MHz, 100MHz, 133MHz (8MHz XTAL doesn't support), 160Mhz, 200MHz, 240MHz, 300MHz, 400MHz, 450MHz and 500MHz."
#endif

#if (IFX_CFG_CLOCK_PPUPLL_FREQUENCY == (400000000))
#define IFXCLOCK_CFG_PPUPLL_FREQ 400MHZ
#elif (IFX_CFG_CLOCK_PPUPLL_FREQUENCY == (450000000))
#define IFXCLOCK_CFG_PPUPLL_FREQ 450MHZ
#else
#error "Wrong PPUPLL frequency configuration!, check IFX_CFG_CLOCK_PLLPPU_FREQUENCY configuration in Ifx_Cfg.h."
#error "Supported PPUPLL frequencies are 400MHz and 450MHz."
#endif

/******************************************************************************/
/*                           Per PLL Config                                   */
/******************************************************************************/

#if (IFX_CFG_CLOCK_PERPLL1_FREQUENCY == (160000000))
#define IFXCLOCK_CFG_PERPLL1_FREQ     160MHZ
#else
#error "Wrong PLL1 frequency configuration!, check IFX_CFG_CLOCK_PLL1_FREQUENCY configuration in Ifx_Cfg.h."
#error "Supported PLL1 frequency is 160MHz."
#endif

#if (IFX_CFG_CLOCK_PERPLL2_FREQUENCY == (200000000))
#define IFXCLOCK_CFG_PERPLL2_FREQ 200MHZ
#else
#error "Wrong PLL2 frequency configuration!, check IFX_CFG_CLOCK_PLL2_FREQUENCY configuration in Ifx_Cfg.h."
#error "Supported PLL2 frequency is 200MHz."
#endif

#if (IFX_CFG_CLOCK_PERPLL3_FREQUENCY == (200000000))
#define IFXCLOCK_CFG_PERPLL3_FREQ 200MHZ
#else
#error "Wrong PLL3 frequency configuration!, check IFX_CFG_CLOCK_PLL3_FREQUENCY configuration in Ifx_Cfg.h."
#error "Supported PLL3 frequency is 200MHz."
#endif

/***************************************************************************************************/

/***************************************************************************************************/
/*********************** SYSPLL CONFIGURATIONS *****************************************************/
/***************************************************************************************************/

/*******************************20MHz Oscillator Frequency******************************************/

