yaswanth8872y/AURIX_code_examples/code_examples/iLLD_TC4D7_LK_ADS_QSPI_TLE9180D_2/Libraries/iLLD/TC4DA/CpuGeneric/_Impl/IfxClock_cfg.h
/************** Target = 400MHz *****************/

#if defined(IFX_CLOCK_DISABLE_RAMPCON)
/* Ramp Osc is disabled hence k2 and k3 dividers have initial step value */
#ifndef IFXCLOCK_CFG_SYS_PLL_20MHZ_400MHZ_400MHZ
/**** Macro for Initial Pll step, for profile with 20MHz Crystal and 400MHz target (fDCO= 800)*/
#define IFXCLOCK_CFG_SYS_PLL_20MHZ_400MHZ_400MHZ                           \
/*{ uint8 pDivider, uint8 nDivider, uint8 k2Initial, uint8 k2PreDivider, uint8 k3Initial, uint8 k3PreDivider}*/            \
    {(IfxClock_Pdivider)(1 - 1), (IfxClock_Ndivider)(40 - 1), (IfxClock_K2divider)(8 - 1), (IfxClock_K2PreDivider)(1 - 1), (IfxClock_K3divider)(2 - 1), (IfxClock_K3PreDivider)(1 - 1)}
#endif /*#ifndef IFXCLOCK_CFG_SYS_PLL_20MHZ_400MHZ_400MHZ */
#else
/* Ramp Osc is enabled hence k2 and k3 dividers have final step value */
#ifndef IFXCLOCK_CFG_SYS_PLL_20MHZ_400MHZ_400MHZ
/**** Macro for Initial Pll step, for profile with 20MHz Crystal and 400MHz target (fDCO= 800)*/
#define IFXCLOCK_CFG_SYS_PLL_20MHZ_400MHZ_400MHZ                            \
/*{ uint8 pDivider, uint8 nDivider, uint8 k2Initial, uint8 k2PreDivider, uint8 k3Initial, uint8 k3PreDivider}*/            \
    {(IfxClock_Pdivider)(1 - 1), (IfxClock_Ndivider)(40 - 1), (IfxClock_K2divider)(2 - 1), (IfxClock_K2PreDivider)(1 - 1), (IfxClock_K3divider)(2 - 1), (IfxClock_K3PreDivider)(1 - 1)}
#endif /*#ifndef IFXCLOCK_CFG_SYS_PLL_20MHZ_400MHZ_400MHZ */
#endif /*#ifdefined IFX_CLOCK_DISABLE_RAMPCON */

/************** Target = 450MHz *****************/

#if defined(IFX_CLOCK_DISABLE_RAMPCON)
/* Ramp Osc is disabled hence k2 and k3 dividers have initial step value */
#ifndef IFXCLOCK_CFG_SYS_PLL_20MHZ_450MHZ_450MHZ
/**** Macro for Initial Pll step, for profile with 20MHz Crystal and 450MHZ target (fDCO= 450)*/
#define IFXCLOCK_CFG_SYS_PLL_20MHZ_450MHZ_450MHZ                           \
/*{ uint8 pDivider, uint8 nDivider, uint8 k2Initial, uint8 k2PreDivider, uint8 k3Initial, uint8 k3PreDivider}*/            \
    {(IfxClock_Pdivider)(2 - 1), (IfxClock_Ndivider)(45 - 1), (IfxClock_K2divider)(3 - 1), (IfxClock_K2PreDivider)(1 - 1), (IfxClock_K3divider)(1 - 1), (IfxClock_K3PreDivider)(1 - 1)}
#endif /*#ifndef IFXCLOCK_CFG_SYS_PLL_20MHZ_450MHZ_450MHZ */
#else
/* Ramp Osc is enabled hence k2 and k3 dividers have final step value */
#ifndef IFXCLOCK_CFG_SYS_PLL_20MHZ_450MHZ_450MHZ
/**** Macro for Initial Pll step, for profile with 20MHz Crystal and 450MHz target (fDCO= 450)*/
#define IFXCLOCK_CFG_SYS_PLL_20MHZ_450MHZ_450MHZ                           \
/*{ uint8 pDivider, uint8 nDivider, uint8 k2Initial, uint8 k2PreDivider, uint8 k3Initial, uint8 k3PreDivider }*/            \
    {(IfxClock_Pdivider)(2 - 1), (IfxClock_Ndivider)(45 - 1), (IfxClock_K2divider)(1 - 1), (IfxClock_K2PreDivider)(1 - 1), (IfxClock_K3divider)(1 - 1), (IfxClock_K3PreDivider)(1 - 1) }
#endif /*#ifndef IFXCLOCK_CFG_SYS_PLL_20MHZ_450MHZ_450MHZ */
#endif /*#ifdefined IFX_CLOCK_DISABLE_RAMPCON */

#ifndef IFXCLOCK_CFG_PLL_STEPS_FDCO_800MHZ_TO_TARGET_400MHZ
#define IFXCLOCK_CFG_PLL_STEPS_FDCO_800MHZ_TO_TARGET_400MHZ              \
   (6 - 1), (4 - 1), (3 - 1), (2 - 1)
#endif /*#ifndef IFXCLOCK_CFG_PLL_STEPS_FDCO_800MHZ_TO_TARGET_400MHZ */

#ifndef IFXCLOCK_CFG_PLL_STEPS_FDCO_450MHZ_TO_TARGET_450MHZ
#define IFXCLOCK_CFG_PLL_STEPS_FDCO_450MHZ_TO_TARGET_450MHZ              \
   (3 - 1), (2 - 1), (1 - 1)
#endif /*#ifndef IFXCLOCK_CFG_PLL_STEPS_FDCO_450MHZ_TO_TARGET_450MHZ */

#ifndef IFXCLOCK_CFG_PLL_STEPS_20MHZ_400MHZ
/**** Macro for Pll step for profile with 20MHz Crystal and 400MHz target (fDCO= 800MHz)*/
#define IFXCLOCK_CFG_PLL_STEPS_20MHZ_400MHZ  IFXCLOCK_CFG_PLL_STEPS_FDCO_800MHZ_TO_TARGET_400MHZ
#endif /*#ifndef IFXCLOCK_CFG_PLL_STEPS_20MHZ_400MHZ */

#ifndef IFXCLOCK_CFG_PLL_STEPS_20MHZ_450MHZ
/**** Macro for Pll step for profile with 20MHz Crystal and 400MHz target (fDCO= 450MHz)*/
#define IFXCLOCK_CFG_PLL_STEPS_20MHZ_450MHZ  IFXCLOCK_CFG_PLL_STEPS_FDCO_450MHZ_TO_TARGET_450MHZ
#endif /*#ifndef IFXCLOCK_CFG_PLL_STEPS_20MHZ_450MHZ */

/************** Target = 500MHz *****************/

#if defined(IFX_CLOCK_DISABLE_RAMPCON)
/* Ramp Osc is disabled hence k2 and k3 dividers have initial step value */
#ifndef IFXCLOCK_CFG_SYS_PLL_20MHZ_500MHZ_450MHZ
/**** Macro for Initial Pll step, for profile with 20MHz Crystal and 500MHz/450MHz target (fDCO= 1GHZ)*/
#define IFXCLOCK_CFG_SYS_PLL_20MHZ_500MHZ_450MHZ                            \
/*{ uint8 pDivider, uint8 nDivider, uint8 k2Initial, uint8 k2PreDivider, uint8 k3Initial, uint8 k3PreDivider}*/            \
    {(IfxClock_Pdivider)(1 - 1), (IfxClock_Ndivider)(50 - 1), (IfxClock_K2divider)(10 - 1), (IfxClock_K2PreDivider)(1 - 1), (IfxClock_K3divider)(2 - 1), (IfxClock_K3PreDivider)(2 - 1) }
#endif /*#ifndef IFXCLOCK_CFG_SYS_PLL_20MHZ_500MHZ_450MHZ */
#else
/* Ramp Osc is enabled hence k2 and k3 dividers have final step value */
#ifndef IFXCLOCK_CFG_SYS_PLL_20MHZ_500MHZ_450MHZ
/**** Macro for Initial Pll step, for profile with 20MHz Crystal and 500MHz target (fDCO= 1GHZ)*/
#define IFXCLOCK_CFG_SYS_PLL_20MHZ_500MHZ_450MHZ                            \
/*{ uint8 pDivider, uint8 nDivider, uint8 k2Initial, uint8 k2PreDivider, uint8 k3Initial, uint8 k3PreDivider}*/            \
    {(IfxClock_Pdivider)(1 - 1), (IfxClock_Ndivider)(50 - 1), (IfxClock_K2divider)(1 - 1), (IfxClock_K2PreDivider)(2 - 1), (IfxClock_K3divider)(2 - 1), (IfxClock_K3PreDivider)(2 - 1)}
#endif /*#ifndef IFXCLOCK_CFG_SYS_PLL_20MHZ_500MHZ_450MHZ */
#endif /*#ifdefined IFX_CLOCK_DISABLE_RAMPCON */

#ifndef IFXCLOCK_CFG_PLL_STEPS_FDCO_500MHZ_TO_TARGET_500MHZ
#define IFXCLOCK_CFG_PLL_STEPS_FDCO_500MHZ_TO_TARGET_500MHZ              \
   (5 - 1), (3 - 1), (2 - 1), (1 - 1)
#endif /*#ifndef IFXCLOCK_CFG_PLL_STEPS_FDCO_500MHZ_TO_TARGET_500MHZ */

#ifndef IFXCLOCK_CFG_PLL_STEPS_FDCO_1GHZ_TO_TARGET_500MHZ
#define IFXCLOCK_CFG_PLL_STEPS_FDCO_1GHZ_TO_TARGET_500MHZ              \
   (6 - 1), (5 - 1), (3 - 1), (2 - 1)
#endif /*#ifndef IFXCLOCK_CFG_PLL_STEPS_FDCO_1GHZ_TO_TARGET_500MHZ */


#ifndef IFXCLOCK_CFG_PLL_STEPS_20MHZ_500MHZ
/**** Macro for Pll step for profile with 20MHz Crystal and 500MHz target (fDCO= 500MHz)*/
#define IFXCLOCK_CFG_PLL_STEPS_20MHZ_500MHZ  IFXCLOCK_CFG_PLL_STEPS_FDCO_500MHZ_TO_TARGET_500MHZ
#endif /*#ifndef IFXCLOCK_CFG_PLL_STEPS_20MHZ_500MHZ */

/*******************************25MHz Oscillator Frequency******************************************/

