yaswanth8872y/AURIX_code_examples/code_examples/iLLD_TC4D7_LK_ADS_QSPI_TLE9180D_2/Libraries/iLLD/TC4DA/CpuGeneric/_Impl/IfxClock_cfg.h
/************** Target = 400MHz *****************/

#if defined(IFX_CLOCK_DISABLE_RAMPCON)
/* Ramp Osc is disabled hence k2 and k3 dividers have initial step value */
#ifndef IFXCLOCK_CFG_SYS_PLL_50MHZ_400MHZ_400MHZ
/**** Macro for Initial Pll step, for profile with 50MHz Crystal and 400MHz target (fDCO= 800)*/
#define IFXCLOCK_CFG_SYS_PLL_50MHZ_400MHZ_400MHZ                           \
/*{ uint8 pDivider, uint8 nDivider, uint8 k2Initial, uint8 k2PreDivider, uint8 k3Initial, uint8 k3PreDivider}*/            \
    {(IfxClock_Pdivider)(1 - 1), (IfxClock_Ndivider)(16 - 1), (IfxClock_K2divider)(8 - 1), (IfxClock_K2PreDivider)(1 - 1), (IfxClock_K3divider)(2 - 1), (IfxClock_K3PreDivider)(1 - 1)}
#endif /*#ifndef IFXCLOCK_CFG_SYS_PLL_50MHZ_400MHZ_400MHZ */
#else
/* Ramp Osc is enabled hence k2 and k3 dividers have final step value */
#ifndef IFXCLOCK_CFG_SYS_PLL_50MHZ_400MHZ_400MHZ
/**** Macro for Initial Pll step, for profile with 50MHz Crystal and 400MHz target (fDCO= 800)*/
#define IFXCLOCK_CFG_SYS_PLL_50MHZ_400MHZ_400MHZ                            \
/*{ uint8 pDivider, uint8 nDivider, uint8 k2Initial, uint8 k2PreDivider, uint8 k3Initial, uint8 k3PreDivider}*/            \
    {(IfxClock_Pdivider)(1 - 1), (IfxClock_Ndivider)(16 - 1), (IfxClock_K2divider)(2 - 1), (IfxClock_K2PreDivider)(1 - 1), (IfxClock_K3divider)(2 - 1), (IfxClock_K3PreDivider)(1 - 1)}
#endif /*#ifndef IFXCLOCK_CFG_SYS_PLL_50MHZ_400MHZ_400MHZ */
#endif /*#ifdefined IFX_CLOCK_DISABLE_RAMPCON */

/************** Target = 450MHz *****************/

#if defined(IFX_CLOCK_DISABLE_RAMPCON)
/* Ramp Osc is disabled hence k2 and k3 dividers have initial step value */
#ifndef IFXCLOCK_CFG_SYS_PLL_50MHZ_450MHZ_450MHZ
/**** Macro for Initial Pll step, for profile with 50MHz Crystal and 450MHZ target (fDCO= 450)*/
#define IFXCLOCK_CFG_SYS_PLL_50MHZ_450MHZ_450MHZ                           \
/*{ uint8 pDivider, uint8 nDivider, uint8 k2Initial, uint8 k2PreDivider, uint8 k3Initial, uint8 k3PreDivider}*/            \
    {(IfxClock_Pdivider)(1 - 1), (IfxClock_Ndivider)(9 - 1), (IfxClock_K2divider)(3 - 1), (IfxClock_K2PreDivider)(1 - 1), (IfxClock_K3divider)(1 - 1), (IfxClock_K3PreDivider)(1 - 1)}
#endif /*#ifndef IFXCLOCK_CFG_SYS_PLL_50MHZ_450MHZ_450MHZ */
#else
/* Ramp Osc is enabled hence k2 and k3 dividers have final step value */
#ifndef IFXCLOCK_CFG_SYS_PLL_50MHZ_450MHZ_450MHZ
/**** Macro for Initial Pll step, for profile with 50MHz Crystal and 450MHz target (fDCO= 450)*/
#define IFXCLOCK_CFG_SYS_PLL_50MHZ_450MHZ_450MHZ                           \
/*{ uint8 pDivider, uint8 nDivider, uint8 k2Initial, uint8 k2PreDivider, uint8 k3Initial, uint8 k3PreDivider }*/            \
    {(IfxClock_Pdivider)(1 - 1), (IfxClock_Ndivider)(9 - 1), (IfxClock_K2divider)(1 - 1), (IfxClock_K2PreDivider)(1 - 1), (IfxClock_K3divider)(1 - 1), (IfxClock_K3PreDivider)(1 - 1) }
#endif /*#ifndef IFXCLOCK_CFG_SYS_PLL_50MHZ_450MHZ_450MHZ */
#endif /*#ifdefined IFX_CLOCK_DISABLE_RAMPCON */


#ifndef IFXCLOCK_CFG_PLL_STEPS_50MHZ_400MHZ
/**** Macro for Pll step for profile with 50MHz Crystal and 400MHz target (fDCO= 800MHz)*/
#define IFXCLOCK_CFG_PLL_STEPS_50MHZ_400MHZ  IFXCLOCK_CFG_PLL_STEPS_FDCO_800MHZ_TO_TARGET_400MHZ
#endif /*#ifndef IFXCLOCK_CFG_PLL_STEPS_50MHZ_400MHZ */

#ifndef IFXCLOCK_CFG_PLL_STEPS_50MHZ_450MHZ
/**** Macro for Pll step for profile with 50MHz Crystal and 400MHz target (fDCO= 450MHz)*/
#define IFXCLOCK_CFG_PLL_STEPS_50MHZ_450MHZ  IFXCLOCK_CFG_PLL_STEPS_FDCO_450MHZ_TO_TARGET_450MHZ
#endif /*#ifndef IFXCLOCK_CFG_PLL_STEPS_50MHZ_450MHZ */

/************** Target = 500MHz *****************/

#if defined(IFX_CLOCK_DISABLE_RAMPCON)
/* Ramp Osc is disabled hence k2 and k3 dividers have initial step value */
#ifndef IFXCLOCK_CFG_SYS_PLL_50MHZ_500MHZ_450MHZ
/**** Macro for Initial Pll step, for profile with 50MHz Crystal and 500MHz/450MHz target (fDCO= 500)*/
#define IFXCLOCK_CFG_SYS_PLL_50MHZ_500MHZ_450MHZ                            \
/*{ uint8 pDivider, uint8 nDivider, uint8 k2Initial, uint8 k2PreDivider, uint8 k3Initial, uint8 k3PreDivider}*/            \
    {(IfxClock_Pdivider)(1 - 1), (IfxClock_Ndivider)(10 - 1), (IfxClock_K2divider)(5 - 1), (IfxClock_K2PreDivider)(1 - 1), (IfxClock_K3divider)(1 - 1), (IfxClock_K3PreDivider)(2 - 1) }
#endif /*#ifndef IFXCLOCK_CFG_SYS_PLL_50MHZ_500MHZ_450MHZ */
#else
/* Ramp Osc is enabled hence k2 and k3 dividers have final step value */
#ifndef IFXCLOCK_CFG_SYS_PLL_50MHZ_500MHZ_450MHZ
/**** Macro for Initial Pll step, for profile with 50MHz Crystal and 500MHz target (fDCO= 500)*/
#define IFXCLOCK_CFG_SYS_PLL_50MHZ_500MHZ_450MHZ                            \
/*{ uint8 pDivider, uint8 nDivider, uint8 k2Initial, uint8 k2PreDivider, uint8 k3Initial, uint8 k3PreDivider}*/            \
    {(IfxClock_Pdivider)(1 - 1), (IfxClock_Ndivider)(10 - 1), (IfxClock_K2divider)(1 - 1), (IfxClock_K2PreDivider)(1 - 1), (IfxClock_K3divider)(1 - 1), (IfxClock_K3PreDivider)(2 - 1)}
#endif /*#ifndef IFXCLOCK_CFG_SYS_PLL_50MHZ_500MHZ_450MHZ */
#endif /*#ifdefined IFX_CLOCK_DISABLE_RAMPCON */


#ifndef IFXCLOCK_CFG_PLL_STEPS_50MHZ_500MHZ
/**** Macro for Pll step for profile with 50MHz Crystal and 500MHz target (fDCO= 500MHz)*/
#define IFXCLOCK_CFG_PLL_STEPS_50MHZ_500MHZ  IFXCLOCK_CFG_PLL_STEPS_FDCO_500MHZ_TO_TARGET_500MHZ
#endif /*#ifndef IFXCLOCK_CFG_PLL_STEPS_50MHZ_500MHZ */

/***************************************************************************************************/

/******************************* OSCCON DEFAULT ******************************************/
#ifndef IFX_CLOCK_OSCCON_HYSEN_VAL
#define IFX_CLOCK_OSCCON_HYSEN_VAL               (1)
#endif

#ifndef IFX_CLOCK_OSCCON_X1CAP0EN_VAL
#define IFX_CLOCK_OSCCON_X1CAP0EN_VAL            (0)
#endif

#ifndef IFX_CLOCK_OSCCON_X1CAP1EN_VAL
#define IFX_CLOCK_OSCCON_X1CAP1EN_VAL            (0)
#endif

#ifndef IFX_CLOCK_OSCCON_X1CAP2EN_VAL
#define IFX_CLOCK_OSCCON_X1CAP2EN_VAL            (0)
#endif

#ifndef IFX_CLOCK_OSCCON_X1CAP3EN_VAL
#define IFX_CLOCK_OSCCON_X1CAP3EN_VAL            (0)
#endif

#ifndef IFX_CLOCK_OSCCON_X2CAP0EN_VAL
#define IFX_CLOCK_OSCCON_X2CAP0EN_VAL            (0)
#endif

#ifndef IFX_CLOCK_OSCCON_X2CAP1EN_VAL
#define IFX_CLOCK_OSCCON_X2CAP1EN_VAL            (0)
#endif

