yaswanth8872y/AURIX_code_examples/code_examples/iLLD_TC4D7_LK_ADS_QSPI_TLE9180D_2/Libraries/iLLD/TC4DA/CpuGeneric/_Impl/IfxClock_cfg.h
#ifndef IFX_CLOCK_OSCCON_X2CAP2EN_VAL
#define IFX_CLOCK_OSCCON_X2CAP2EN_VAL            (0)
#endif

#ifndef IFX_CLOCK_OSCCON_X2CAP3EN_VAL
#define IFX_CLOCK_OSCCON_X2CAP3EN_VAL            (0)
#endif

/***************************************************************************************************/

/*********************** PERPLL CONFIGURATIONS *****************************************************/
/***************************************************************************************************/

/*******************************20MHz Oscillator Frequency******************************************/

/************** Fpll1 = 160MHz, Fpll2 = 200MHz, Fpll3 = 200MHz *****************/

#ifndef IFXCLOCK_CFG_PER_PLL_20MHZ_160MHZ_200MHZ_200MHZ
/** \brief Macro for Initial Pll step, for profile with 20MHz Crystal and 160/200MHz target (fDCO= 800)*/
#define IFXCLOCK_CFG_PER_PLL_20MHZ_160MHZ_200MHZ_200MHZ                           \
/*{ uint8 pDivider, uint8 nDivider, uint8 k2Initial, uint8 k2Predivider, uint8 k3Divider, uint8 k3Predivider, uint8 k4Divider, uint8 k4Predivider}*/\
    {(IfxClock_Pdivider)(1 - 1), (IfxClock_Ndivider)(40 - 1), (IfxClock_K2divider)(5 - 1), (IfxClock_K2PreDivider)0, (IfxClock_K3divider)(2 - 1), (IfxClock_K3PreDivider)10, (IfxClock_K4divider)(2 - 1),(IfxClock_K4PreDivider)1}
#endif /*#ifndef IFXCLOCK_CFG_PER_PLL_20MHZ_160MHZ_200MHZ */

/*******************************25MHz Oscillator Frequency******************************************/

/************** Fpll1 = 160MHz, Fpll2 = 200MHz, Fpll3 = 200MHz *****************/

#ifndef IFXCLOCK_CFG_PER_PLL_25MHZ_160MHZ_200MHZ_200MHZ
/** \brief Macro for Initial Pll step, for profile with 25MHz Crystal and 160/200MHz target (fDCO= 800)*/
#define IFXCLOCK_CFG_PER_PLL_25MHZ_160MHZ_200MHZ_200MHZ                           \
/*{ uint8 pDivider, uint8 nDivider, uint8 k2Initial, uint8 k2Predivider, uint8 k3Divider, uint8 k3Predivider, uint8 k4Divider, uint8 k4Predivider}*/\
    {(IfxClock_Pdivider)(1 - 1), (IfxClock_Ndivider)(32 - 1), (IfxClock_K2divider)(5 - 1), (IfxClock_K2PreDivider)0, (IfxClock_K3divider)(2 - 1), (IfxClock_K3PreDivider)10, (IfxClock_K4divider)(2 - 1),(IfxClock_K4PreDivider)1}
#endif /*#ifndef IFXCLOCK_CFG_PER_PLL_25MHZ_160MHZ_200MHZ */

/*******************************10MHz Oscillator Frequency******************************************/

/************** Fpll1 = 160MHz, Fpll2 = 200MHz, Fpll3 = 200MHz *****************/

#ifndef IFXCLOCK_CFG_PER_PLL_10MHZ_160MHZ_200MHZ_200MHZ
/** \brief Macro for Initial Pll step, for profile with 10MHz Crystal and 160/200MHz target (fDCO= 800)*/
#define IFXCLOCK_CFG_PER_PLL_10MHZ_160MHZ_200MHZ_200MHZ                           \
/*{ uint8 pDivider, uint8 nDivider, uint8 k2Initial, uint8 k2Predivider, uint8 k3Divider, uint8 k3Predivider, uint8 k4Divider, uint8 k4Predivider}*/\
    {(IfxClock_Pdivider)(1 - 1), (IfxClock_Ndivider)(80 - 1), (IfxClock_K2divider)(5 - 1), (IfxClock_K2PreDivider)0, (IfxClock_K3divider)(2 - 1), (IfxClock_K3PreDivider)10, (IfxClock_K4divider)(2 - 1),(IfxClock_K4PreDivider)1}
#endif /*#ifndef IFXCLOCK_CFG_PER_PLL_10MHZ_160MHZ_200MHZ */

/*******************************50MHz Oscillator Frequency******************************************/

/************** Fpll1 = 160MHz, Fpll2 = 200MHz, Fpll3 = 200MHz *****************/

#ifndef IFXCLOCK_CFG_PER_PLL_50MHZ_160MHZ_200MHZ_200MHZ
/** \brief Macro for Initial Pll step, for profile with 50MHz Crystal and 160/200MHz target (fDCO= 800)*/
#define IFXCLOCK_CFG_PER_PLL_50MHZ_160MHZ_200MHZ_200MHZ                           \
/*{ uint8 pDivider, uint8 nDivider, uint8 k2Initial, uint8 k2Predivider, uint8 k3Divider, uint8 k3Predivider, uint8 k4Divider, uint8 k4Predivider}*/\
    {(IfxClock_Pdivider)(1 - 1), (IfxClock_Ndivider)(16 - 1), (IfxClock_K2divider)(5 - 1), (IfxClock_K2PreDivider)0, (IfxClock_K3divider)(2 - 1), (IfxClock_K3PreDivider)10, (IfxClock_K4divider)(2 - 1),(IfxClock_K4PreDivider)1}
#endif /*#ifndef IFXCLOCK_CFG_PER_PLL_50MHZ_160MHZ_200MHZ */


/*******************************40MHz Oscillator Frequency******************************************/

/************** Fpll1 = 160MHz, Fpll2 = 200MHz, Fpll3 = 200MHz *****************/

#ifndef IFXCLOCK_CFG_PER_PLL_40MHZ_160MHZ_200MHZ_200MHZ
/** \brief Macro for Initial Pll step, for profile with 40MHz Crystal and 160/200MHz target (fDCO= 800)*/
#define IFXCLOCK_CFG_PER_PLL_40MHZ_160MHZ_200MHZ_200MHZ                           \
/*{ uint8 pDivider, uint8 nDivider, uint8 k2Initial, uint8 k2Predivider, uint8 k3Divider, uint8 k3Predivider, uint8 k4Divider, uint8 k4Predivider}*/\
    {(IfxClock_Pdivider)(1 - 1), (IfxClock_Ndivider)(20 - 1), (IfxClock_K2divider)(5 - 1), (IfxClock_K2PreDivider)0, (IfxClock_K3divider)(2 - 1), (IfxClock_K3PreDivider)10, (IfxClock_K4divider)(2 - 1),(IfxClock_K4PreDivider)1}
#endif /*#ifndef IFXCLOCK_CFG_PER_PLL_40MHZ_160MHZ_200MHZ */


/***************************** Final Macro Setting for PLL ****************************************/
#define IFXCLOCK_CFG_PLL_STEPS_BASIC_(xtalFreq, pll0Freq)        IFXCLOCK_CFG_PLL_STEPS_##xtalFreq##_##pll0Freq
#define IFXCLOCK_CFG_PLL_STEPS_BASIC(xtalFreq, pll0Freq)         IFXCLOCK_CFG_PLL_STEPS_BASIC_(xtalFreq, pll0Freq)
#define IFXCLOCK_CFG_PLL_STEPS        IFXCLOCK_CFG_PLL_STEPS_BASIC(IFXCLOCK_CFG_XTAL_FREQ, IFXCLOCK_CFG_SYSPLL_FREQ)

/****************** initial step configuration definitions ******************************/
/*macro for sys pll initial step configuration */
#define IFXCLOCK_CFG_SYS_PLL_INITIAL_STEP_BASIC_(xtalFreq, pll0Freq, ppuFreq) IFXCLOCK_CFG_SYS_PLL_##xtalFreq##_##pll0Freq##_##ppuFreq
#define IFXCLOCK_CFG_SYS_PLL_INITIAL_STEP_BASIC(xtalFreq, pll0Freq, ppuFreq)  IFXCLOCK_CFG_SYS_PLL_INITIAL_STEP_BASIC_(xtalFreq, pll0Freq, ppuFreq)
#define IFXCLOCK_CFG_SYS_PLL_INITIAL_STEP IFXCLOCK_CFG_SYS_PLL_INITIAL_STEP_BASIC(IFXCLOCK_CFG_XTAL_FREQ, IFXCLOCK_CFG_SYSPLL_FREQ, IFXCLOCK_CFG_PPUPLL_FREQ)

/*macro for per pll initial step configuration */
#define IFXCLOCK_CFG_PER_PLL_INITIAL_STEP_BASIC_(xtalFreq, pll1Freq, pll2Freq, pll3freq) IFXCLOCK_CFG_PER_PLL_##xtalFreq##_##pll1Freq##_##pll2Freq##_##pll3freq
#define IFXCLOCK_CFG_PER_PLL_INITIAL_STEP_BASIC(xtalFreq, pll1Freq, pll2Freq, pll3freq)  IFXCLOCK_CFG_PER_PLL_INITIAL_STEP_BASIC_(xtalFreq, pll1Freq, pll2Freq, pll3freq)
#define IFXCLOCK_CFG_PER_PLL_INITIAL_STEP IFXCLOCK_CFG_PER_PLL_INITIAL_STEP_BASIC(IFXCLOCK_CFG_XTAL_FREQ, IFXCLOCK_CFG_PERPLL1_FREQ, IFXCLOCK_CFG_PERPLL2_FREQ, IFXCLOCK_CFG_PERPLL3_FREQ)


/***************************************************************************************************/
/*********************** DIVIDER CONFIGURATIONS ****************************************************/
/***************************************************************************************************/

/**************** DIVIDERS DEPENDING ON FSource0 (Fpll0) *******************************************/

