yaswanth8872y/AURIX_code_examples/code_examples/iLLD_TC4D7_LK_ADS_QSPI_TLE9180D_2/Libraries/iLLD/TC4DA/CpuGeneric/_Impl/IfxClock_cfg.h
/************************* PLL0 400MHz **************************/
/****************************************************** ********/
/************** SYSCCUCON0 : STMDIV  (Output : fSTM)**************/
/* Target = 400 MHz AND Source = Fsource0 */
#ifndef IFXCLOCK_CFG_STMDIV_400MHZ
#define IFXCLOCK_CFG_STMDIV_400MHZ             (1)
#endif /*#ifndef IFXCLOCK_CFG_STMDIV_400MHZ */

/************** SYSCCUCON1 : EGTMDIV  (Output : fEGTM)**************/
/* Target = 400 MHz AND Source = Fsource0 */
#ifndef IFXCLOCK_CFG_EGTMDIV_400MHZ
#define IFXCLOCK_CFG_EGTMDIV_400MHZ             (1)
#endif /*#ifndef IFXCLOCK_CFG_GTMDIV_400MHZ */

/************** SYSCCUCON0 : SRIDIV  (Output : fSRI)**************/
/* Target = 400 MHz AND Source = Fsource0 */
#ifndef IFXCLOCK_CFG_SRIDIV_400MHZ
#define IFXCLOCK_CFG_SRIDIV_400MHZ             (1)
#endif /*#ifndef IFXCLOCK_CFG_SRIDIV_400MHZ */

/************** SYSCCUCON0 : SPBDIV  (Output : fSPB)**************/
/* Target = 100 MHz AND Source = Fsource0 */
#ifndef IFXCLOCK_CFG_SPBDIV_400MHZ
#define IFXCLOCK_CFG_SPBDIV_400MHZ             (4)
#endif /*#ifndef IFXCLOCK_CFG_SPBDIV_400MHZ */

/************** SYSCCUCON0 : TPBDIV  (Output : fTPB)**************/
/* Target = 200 MHz AND Source = Fsource0 */
#ifndef IFXCLOCK_CFG_TPBDIV_400MHZ
#define IFXCLOCK_CFG_TPBDIV_400MHZ             (2)
#endif /*#ifndef IFXCLOCK_CFG_TPBDIV_400MHZ */

/************** SYSCCUCON0 : CPBDIV  (Output : fCPB)**************/
/* Target = 200 MHz AND Source = Fsource0 */
#ifndef IFXCLOCK_CFG_CPBDIV_400MHZ
#define IFXCLOCK_CFG_CPBDIV_400MHZ             (2)
#endif /*#ifndef IFXCLOCK_CFG_CPBDIV_400MHZ */

/************** SYSCCUCON0 : FSIDIV  (Output : fFSI)**************/
/* Target = 100 MHz AND Source = Fsri */
#ifndef IFXCLOCK_CFG_FSIDIV_400MHZ
#define IFXCLOCK_CFG_FSIDIV_400MHZ             (IFXCLOCK_CFG_SRIDIV_400MHZ * 4)
#endif /*#ifndef IFXCLOCK_CFG_FSIDIV_400MHZ */

/************** SYSCCUCON0 : FSI2DIV  (Output : fFSI2)**************/
/* Target = 400 MHz AND Source = Fsri */
#ifndef IFXCLOCK_CFG_FSI2DIV_400MHZ
#define IFXCLOCK_CFG_FSI2DIV_400MHZ             (IFXCLOCK_CFG_SRIDIV_400MHZ * 1)
#endif /*#ifndef IFXCLOCK_CFG_FSI2DIV_400MHZ */

/************** SYSCCUCON1 : XGETH0DIV  (Output : fXGETH0)**************/
/* Target = 200 MHz AND Source = Fsource0 */
#ifndef IFXCLOCK_CFG_XGETH0DIV_400MHZ
#define IFXCLOCK_CFG_XGETH0DIV_400MHZ             (2)
#endif /*#ifndef IFXCLOCK_CFG_XGETH0DIV_400MHZ */

/************** SYSCCUCON1 : XGETH1DIV  (Output : fXGETH1)**************/
/* Target = 200 MHz AND Source = Fsource0 */
#ifndef IFXCLOCK_CFG_XGETH1DIV_400MHZ
#define IFXCLOCK_CFG_XGETH1DIV_400MHZ             (2)
#endif /*#ifndef IFXCLOCK_CFG_XGETH1DIV_400MHZ */

/************** SYSCCUCON1 : LETHDIV  (Output : fLETH)**************/
/* Target = 200 MHz AND Source = Fsource0 */
#ifndef IFXCLOCK_CFG_LETHDIV_400MHZ
#define IFXCLOCK_CFG_LETHDIV_400MHZ             (2)
#endif /*#ifndef IFXCLOCK_CFG_LETHDIV_400MHZ */

/************** SYSCCUCON1 : CANXLHDIV  (Output : fCANXLH)**************/
/* Target = 200 MHz AND Source = Fsource0 */
#ifndef IFXCLOCK_CFG_CANXLHDIV_400MHZ
#define IFXCLOCK_CFG_CANXLHDIV_400MHZ             (2)
#endif /*#ifndef IFXCLOCK_CFG_CANXLHDIV_400MHZ */

/************** SYSCCUCON1 : MCANHDIV  (Output : fMCANH)**************/
/* Target = 200 MHz AND Source = Fsource0 */
#ifndef IFXCLOCK_CFG_MCANHDIV_400MHZ
#define IFXCLOCK_CFG_MCANHDIV_400MHZ             (2)
#endif /*#ifndef IFXCLOCK_CFG_MCANHDIV_400MHZ */

/************** SYSCCUCON0 : SRICSDIV  (Output : fSRI)**************/
/* Target = 400 MHz AND Source = Fsource0 */
#ifndef IFXCLOCK_CFG_SRICSDIV_400MHZ
#define IFXCLOCK_CFG_SRICSDIV_400MHZ             (1)
#endif /*#ifndef IFXCLOCK_CFG_SRICSDIV_400MHZ */

/************************* PLL0 450MHz **************************/
/****************************************************** ********/
/************** SYSCCUCON0 : STMDIV  (Output : fSTM)**************/
/* Target = 450 MHz AND Source = Fsource0 */
#ifndef IFXCLOCK_CFG_STMDIV_450MHZ
#define IFXCLOCK_CFG_STMDIV_450MHZ             (1)
#endif /*#ifndef IFXCLOCK_CFG_STMDIV_450MHZ */

/************** SYSCCUCON1 : EGTMDIV  (Output : fEGTM)**************/
/* Target = 450 MHz AND Source = Fsource0 */
#ifndef IFXCLOCK_CFG_EGTMDIV_450MHZ
#define IFXCLOCK_CFG_EGTMDIV_450MHZ             (1)
#endif /*#ifndef IFXCLOCK_CFG_GTMDIV_450MHZ */

/************** SYSCCUCON0 : SRIDIV  (Output : fSRI)**************/
/* Target = 450 MHz AND Source = Fsource0 */
#ifndef IFXCLOCK_CFG_SRIDIV_450MHZ
#define IFXCLOCK_CFG_SRIDIV_450MHZ             (1)
#endif /*#ifndef IFXCLOCK_CFG_SRIDIV_450MHZ */

/************** SYSCCUCON0 : SPBDIV  (Output : fSPB)**************/
/* Target = 150 MHz AND Source = Fsource0 */
#ifndef IFXCLOCK_CFG_SPBDIV_450MHZ
#define IFXCLOCK_CFG_SPBDIV_450MHZ             (5)
#endif /*#ifndef IFXCLOCK_CFG_SPBDIV_450MHZ */

/************** SYSCCUCON0 : CPBDIV  (Output : fCPB)**************/
/* Target = 225 MHz AND Source = Fsource0 */
#ifndef IFXCLOCK_CFG_CPBDIV_450MHZ
#define IFXCLOCK_CFG_CPBDIV_450MHZ             (2)
#endif /*#ifndef IFXCLOCK_CFG_CPBDIV_400MHZ */

/************** SYSCCUCON0 : TPBDIV  (Output : fTPB)**************/
/* Target = 225 MHz AND Source = Fsource0 */
#ifndef IFXCLOCK_CFG_TPBDIV_450MHZ
#define IFXCLOCK_CFG_TPBDIV_450MHZ             (2)
#endif /*#ifndef IFXCLOCK_CFG_TPBDIV_450MHZ */

/************** SYSCCUCON0 : FSIDIV  (Output : fFSI)**************/
/* Target = 90 MHz AND Source = Fsri */
#ifndef IFXCLOCK_CFG_FSIDIV_450MHZ
#define IFXCLOCK_CFG_FSIDIV_450MHZ             (IFXCLOCK_CFG_SRIDIV_450MHZ * 5)
#endif /*#ifndef IFXCLOCK_CFG_FSIDIV_450MHZ */

/************** SYSCCUCON0 : FSI2DIV  (Output : fFSI2)**************/
/* Target = 450 MHz AND Source = Fsri */
#ifndef IFXCLOCK_CFG_FSI2DIV_450MHZ
#define IFXCLOCK_CFG_FSI2DIV_450MHZ             (IFXCLOCK_CFG_SRIDIV_450MHZ * 1)
#endif /*#ifndef IFXCLOCK_CFG_FSI2DIV_450MHZ */

/************** SYSCCUCON1 : XGETH0DIV  (Output : fXGETH0)**************/
/* Target = 225 MHz AND Source = Fsource0 */
#ifndef IFXCLOCK_CFG_XGETH0DIV_450MHZ
#define IFXCLOCK_CFG_XGETH0DIV_450MHZ             (2)
#endif /*#ifndef IFXCLOCK_CFG_XGETH0DIV_450MHZ */

/************** SYSCCUCON1 : XGETH1DIV  (Output : fXGETH1)**************/
/* Target = 225 MHz AND Source = Fsource0 */
#ifndef IFXCLOCK_CFG_XGETH1DIV_450MHZ
#define IFXCLOCK_CFG_XGETH1DIV_450MHZ             (2)
#endif /*#ifndef IFXCLOCK_CFG_XGETH1DIV_450MHZ */

/************** SYSCCUCON1 : LETHDIV  (Output : fLETH)**************/
/* Target = 225 MHz AND Source = Fsource0 */
#ifndef IFXCLOCK_CFG_LETHDIV_450MHZ
#define IFXCLOCK_CFG_LETHDIV_450MHZ             (2)
#endif /*#ifndef IFXCLOCK_CFG_LETHDIV_400MHZ */

/************** SYSCCUCON1 : CANXLHDIV  (Output : fCANXLH)**************/
/* Target = 225 MHz AND Source = Fsource0 */
#ifndef IFXCLOCK_CFG_CANXLHDIV_450MHZ
#define IFXCLOCK_CFG_CANXLHDIV_450MHZ             (2)
#endif /*#ifndef IFXCLOCK_CFG_CANXLHDIV_450MHZ */

/************** SYSCCUCON1 : MCANHDIV  (Output : fMCANH)**************/
/* Target = 225 MHz AND Source = Fsource0 */
#ifndef IFXCLOCK_CFG_MCANHDIV_450MHZ
#define IFXCLOCK_CFG_MCANHDIV_450MHZ             (2)
#endif /*#ifndef IFXCLOCK_CFG_MCANHDIV_450MHZ */

/************** SYSCCUCON0 : SRICSDIV  (Output : fSRI)**************/
/* Target = 450 MHz AND Source = Fsource0 */
#ifndef IFXCLOCK_CFG_SRICSDIV_450MHZ
#define IFXCLOCK_CFG_SRICSDIV_450MHZ             (1)
#endif /*#ifndef IFXCLOCK_CFG_SRICSDIV_450MHZ */

/************************* PLL0 500MHz **************************/
/****************************************************** ********/
/************** SYSCCUCON0 : STMDIV  (Output : fSTM)**************/
/* Target = 500 MHz AND Source = Fsource0 */
#ifndef IFXCLOCK_CFG_STMDIV_500MHZ
#define IFXCLOCK_CFG_STMDIV_500MHZ             (1)
#endif /*#ifndef IFXCLOCK_CFG_STMDIV_500MHZ */

/************** SYSCCUCON1 : EGTMDIV  (Output : fEGTM)**************/
/* Target = 250 MHz AND Source = Fsource0 */
#ifndef IFXCLOCK_CFG_EGTMDIV_500MHZ
#define IFXCLOCK_CFG_EGTMDIV_500MHZ             (2)
#endif /*#ifndef IFXCLOCK_CFG_GTMDIV_500MHZ */

/************** SYSCCUCON0 : SRIDIV  (Output : fSRI)**************/
/* Target = 500 MHz AND Source = Fsource0 */
#ifndef IFXCLOCK_CFG_SRIDIV_500MHZ
#define IFXCLOCK_CFG_SRIDIV_500MHZ             (1)
#endif /*#ifndef IFXCLOCK_CFG_SRIDIV_500MHZ */

/************** SYSCCUCON0 : SRICSDIV  (Output : fSRI)**************/
/* Target = 500 MHz AND Source = Fsource0 */
#ifndef IFXCLOCK_CFG_SRICSDIV_500MHZ
#define IFXCLOCK_CFG_SRICSDIV_500MHZ             (1)
#endif /*#ifndef IFXCLOCK_CFG_SRICSDIV_500MHZ */

/************** SYSCCUCON0 : SPBDIV  (Output : fSPB)**************/
/* Target = 100 MHz AND Source = Fsource0 */
#ifndef IFXCLOCK_CFG_SPBDIV_500MHZ
#define IFXCLOCK_CFG_SPBDIV_500MHZ             (5)
#endif /*#ifndef IFXCLOCK_CFG_SPBDIV_500MHZ */

