yaswanth8872y/AURIX_code_examples/code_examples/iLLD_TC4D7_LK_ADS_QSPI_TLE9180D_2/Libraries/iLLD/TC4DA/CpuGeneric/_Impl/IfxClock_cfg.h
/************** SYSCCUCON0 : TPBDIV  (Output : fTPB)**************/
/* Target = 250 MHz AND Source = Fsource0 */
#ifndef IFXCLOCK_CFG_TPBDIV_500MHZ
#define IFXCLOCK_CFG_TPBDIV_500MHZ             (2)
#endif /*#ifndef IFXCLOCK_CFG_TPBDIV_500MHZ */

/************** SYSCCUCON0 : CPBDIV  (Output : fCPB)**************/
/* Target = 250 MHz AND Source = Fsource0 */
#ifndef IFXCLOCK_CFG_CPBDIV_500MHZ
#define IFXCLOCK_CFG_CPBDIV_500MHZ             (2)
#endif /*#ifndef IFXCLOCK_CFG_CPBDIV_500MHZ */


/************** SYSCCUCON0 : FSIDIV  (Output : fFSI)**************/
/* Target = 100 MHz AND Source = Fsri */
#ifndef IFXCLOCK_CFG_FSIDIV_500MHZ
#define IFXCLOCK_CFG_FSIDIV_500MHZ             (IFXCLOCK_CFG_SRIDIV_500MHZ * 5)
#endif /*#ifndef IFXCLOCK_CFG_FSIDIV_500MHZ */

/************** SYSCCUCON0 : FSI2DIV  (Output : fFSI2)**************/
/* Target = 500 MHz AND Source = Fsri */
#ifndef IFXCLOCK_CFG_FSI2DIV_500MHZ
#define IFXCLOCK_CFG_FSI2DIV_500MHZ             (IFXCLOCK_CFG_SRIDIV_500MHZ * 1)
#endif /*#ifndef IFXCLOCK_CFG_FSI2DIV_500MHZ */

/************** SYSCCUCON1 : XGETH0DIV  (Output : fXGETH0)**************/
/* Target = 250 MHz AND Source = Fsource0 */
#ifndef IFXCLOCK_CFG_XGETH0DIV_500MHZ
#define IFXCLOCK_CFG_XGETH0DIV_500MHZ             (2)
#endif /*#ifndef IFXCLOCK_CFG_XGETH0DIV_500MHZ */

/************** SYSCCUCON1 : XGETH1DIV  (Output : fXGETH1)**************/
/* Target = 250 MHz AND Source = Fsource0 */
#ifndef IFXCLOCK_CFG_XGETH1DIV_500MHZ
#define IFXCLOCK_CFG_XGETH1DIV_500MHZ             (2)
#endif /*#ifndef IFXCLOCK_CFG_XGETH1DIV_500MHZ */

/************** SYSCCUCON1 : LETHDIV  (Output : fLETH)**************/
/* Target = 250 MHz AND Source = Fsource0 */
#ifndef IFXCLOCK_CFG_LETHDIV_500MHZ
#define IFXCLOCK_CFG_LETHDIV_500MHZ             (2)
#endif /*#ifndef IFXCLOCK_CFG_LETHDIV_500MHZ */

/************** SYSCCUCON1 : CANXLHDIV  (Output : fCANXLH)**************/
/* Target = 250 MHz AND Source = Fsource0 */
#ifndef IFXCLOCK_CFG_CANXLHDIV_500MHZ
#define IFXCLOCK_CFG_CANXLHDIV_500MHZ             (2)
#endif /*#ifndef IFXCLOCK_CFG_CANXLHDIV_500MHZ */

/************** SYSCCUCON1 : MCANHDIV  (Output : fMCANH)**************/
/* Target = 250 MHz AND Source = Fsource0 */
#ifndef IFXCLOCK_CFG_MCANHDIV_500MHZ
#define IFXCLOCK_CFG_MCANHDIV_500MHZ             (2)
#endif /*#ifndef IFXCLOCK_CFG_MCANHDIV_500MHZ */


#ifndef IFXCLOCK_CFG_ADC_PERON
#define IFXCLOCK_CFG_ADC_PERON             (1)
#endif /*#ifndef IFXCLOCK_CFG_ADC_PERON */

#ifndef IFXCLOCK_CFG_ERAY_PERON
#define IFXCLOCK_CFG_ERAY_PERON             (1)
#endif /*#ifndef IFXCLOCK_CFG_ERAY_PERON */

#ifndef IFXCLOCK_CFG_XSPI_PERON
#define IFXCLOCK_CFG_XSPI_PERON             (1)
#endif /*#ifndef IFXCLOCK_CFG_XSPI_PERON */

#ifndef IFXCLOCK_CFG_SDMMC_PERON
#define IFXCLOCK_CFG_SDMMC_PERON             (1)
#endif /*#ifndef IFXCLOCK_CFG_SDMMMC_PERON */

#ifndef IFXCLOCK_CFG_HSCT_PERON
#define IFXCLOCK_CFG_HSCT_PERON             (1)
#endif /*#ifndef IFXCLOCK_CFG_HSCT_PERON */

#ifndef IFXCLOCK_CFG_LETH100PERON
#define IFXCLOCK_CFG_LETH100PERON             (1)
#endif /*#ifndef IFXCLOCK_CFG_LETH100PERON */

/**************** Fpll1 = 160MHz, Fpll2 = 200MHz ***************************************************/

/************** PERCCUCON0 : MCANDIV  (Output : fMCAN)**************/
/* Target = 160 MHz AND Source = Fsource1 */
#ifndef IFXCLOCK_CFG_MCANDIV_160MHZ_200MHZ
#define IFXCLOCK_CFG_MCANDIV_160MHZ_200MHZ             (1)
#endif /*#ifndef IFXCLOCK_CFG_MCANDIV_160MHZ_200MHZ */

/************** PERCCUCON0 : CLKSELMCAN  (Output : fMCANI)**************/
/* Target = Fmcani MHz AND Source = Fmcani/Fosc0 */
#ifndef IFXCLOCK_CFG_CLKSELMCAN_160MHZ_200MHZ
#define IFXCLOCK_CFG_CLKSELMCAN_160MHZ_200MHZ             (1)
#endif /*#ifndef IFXCLOCK_CFG_CLKSELMCAN_160MHZ_200MHZ */

/************** PERCCUCON0 : I2CDIV  (Output : fI2C)**************/
/* Target = 100 MHz AND Source = Fsource2 */
#ifndef IFXCLOCK_CFG_I2CDIV_160MHZ_200MHZ
#define IFXCLOCK_CFG_I2CDIV_160MHZ_200MHZ             (2)
#endif /*#ifndef IFXCLOCK_CFG_I2CDIV_160MHZ_200MHZ */

/************** PERCCUCON0 : MSCDIV  (Output : fMSC)**************/
/* Target = 160 MHz AND Source = Fsource2 */
#ifndef IFXCLOCK_CFG_MSCDIV_160MHZ_200MHZ
#define IFXCLOCK_CFG_MSCDIV_160MHZ_200MHZ             (1)
#endif /*#ifndef IFXCLOCK_CFG_MSCDIV_160MHZ_200MHZ */

/************** PERCCUCON0 : CLKSELMSC  (Output : fSOURCEMSC)**************/
/* Target = Fsource2 MHz AND Source = Fsource1/Fsource2 */
#ifndef IFXCLOCK_CFG_CLKSELMSC_160MHZ_200MHZ
#define IFXCLOCK_CFG_CLKSELMSC_160MHZ_200MHZ             (2)
#endif /*#ifndef IFXCLOCK_CFG_CLKSELMSC_160MHZ_200MHZ */

/************** PERCCUCON0 : QSPIDIV  (Output : fQSPI)**************/
/* Target = 200 MHz AND Source = Fsource2 */
#ifndef IFXCLOCK_CFG_QSPIDIV_160MHZ_200MHZ
#define IFXCLOCK_CFG_QSPIDIV_160MHZ_200MHZ             (1)
#endif /*#ifndef IFXCLOCK_CFG_QSPIDIV_160MHZ_200MHZ */

/************** PERCCUCON0 : CLKSELQSPI  (Output : fSOURCESPI)**************/
/* Target = Fsource2 MHz AND Source = Fsource1/Fsource2 */
#ifndef IFXCLOCK_CFG_CLKSELQSPI_160MHZ_200MHZ
#define IFXCLOCK_CFG_CLKSELQSPI_160MHZ_200MHZ             (2)
#endif /*#ifndef IFXCLOCK_CFG_CLKSELQSPI_160MHZ_200MHZ */

/************** PERCCUCON1 : CANXLDIV  (Output : fCANXL)**************/
/* Target = 160 MHz AND Source = Fsource1 */
#ifndef IFXCLOCK_CFG_CANXLDIV_160MHZ_200MHZ
#define IFXCLOCK_CFG_CANXLDIV_160MHZ_200MHZ             (1)
#endif /*#ifndef IFXCLOCK_CFG_CANXLDIV_160MHZ_200MHZ */

/************** PERCCUCON1 : PPUDIV  (Output : fPPU)**************/
/* Target = Fsource1/Fsource1 AND Source = Fsourceppu */
#ifndef IFXCLOCK_CFG_PPUDIV_160MHZ_200MHZ
#define IFXCLOCK_CFG_PPUDIV_160MHZ_200MHZ            (1)
#endif /*#ifndef IFXCLOCK_CFG_PPUDIV_160MHZ_200MHZ */

/************** PERCCUCON1 : CLKSELCANXL  (Output : fCANXL)**************/
/* Target = Fcanxl MHz AND Source = Fcanxl/Fosc0 */
#ifndef IFXCLOCK_CFG_CLKSELCANXL_160MHZ_200MHZ
#define IFXCLOCK_CFG_CLKSELCANXL_160MHZ_200MHZ             (1)
#endif /*#ifndef IFXCLOCK_CFG_CLKSELCANXL_160MHZ_200MHZ */

