yaswanth8872y/AURIX_code_examples/code_examples/iLLD_TC4D7_LK_ADS_QSPI_TLE9180D_2/Libraries/iLLD/TC4DA/CpuGeneric/_Impl/IfxClock_cfg.h
/************** PERCCUCON1 : XSPISLDIV  (Output : fXSPISL)**************/
/* Target = 200 MHz AND Source = Fsource3 */
#ifndef IFXCLOCK_CFG_XSPISLDIV_160MHZ_200MHZ
#define IFXCLOCK_CFG_XSPISLDIV_160MHZ_200MHZ             (1)
#endif /*#ifndef IFXCLOCK_CFG_XSPISLDIV_160MHZ_200MHZ */

/************** PERCCUCON1 : ASCLINFDIV  (Output : fASCLINF)**************/
/* Target = 200 MHz AND Source = Fsource2 */
#ifndef IFXCLOCK_CFG_ASCLINFDIV_160MHZ_200MHZ
#define IFXCLOCK_CFG_ASCLINFDIV_160MHZ_200MHZ             (1)
#endif /*#ifndef IFXCLOCK_CFG_ASCLINFDIV_160MHZ_200MHZ */

/************** PERCCUCON1 : ASCLINSDIV  (Output : fASCLINSI)**************/
/* Target = 160 MHz AND Source = Fsource1 */
#ifndef IFXCLOCK_CFG_ASCLINSDIV_160MHZ_200MHZ
#define IFXCLOCK_CFG_ASCLINSDIV_160MHZ_200MHZ             (1)
#endif /*#ifndef IFXCLOCK_CFG_ASCLINSDIV_160MHZ_200MHZ */

/************** PERCCUCON1 : CLKSELASCLINS  (Output : fASCLINS)**************/
/* Target = Fasclinsi MHz AND Source = Fasclinsi/Fosc0 */
#ifndef IFXCLOCK_CFG_CLKSELASCLINS_160MHZ_200MHZ
#define IFXCLOCK_CFG_CLKSELASCLINS_160MHZ_200MHZ             (1)
#endif /*#ifndef IFXCLOCK_CFG_CLKSELASCLINS_160MHZ_200MHZ */

/***************************************************************************************************/
/*********************** REGISTER DEFAULT VALUES ***************************************************/
/***************************************************************************************************/

/************************** OSCCON **************************/
#define IFXCLOCK_CFG_OSCCON_MASK \
    (uint32)( \
        (IFX_CLOCK_OSCCON_HYSEN_MSK << IFX_CLOCK_OSCCON_HYSEN_OFF) | \
        (IFX_CLOCK_OSCCON_X1CAP0EN_MSK << IFX_CLOCK_OSCCON_X1CAP0EN_OFF) |\
        (IFX_CLOCK_OSCCON_X1CAP1EN_MSK << IFX_CLOCK_OSCCON_X1CAP1EN_OFF) |\
        (IFX_CLOCK_OSCCON_X1CAP2EN_MSK << IFX_CLOCK_OSCCON_X1CAP2EN_OFF) |\
        (IFX_CLOCK_OSCCON_X1CAP3EN_MSK << IFX_CLOCK_OSCCON_X1CAP3EN_OFF) |\
        (IFX_CLOCK_OSCCON_X2CAP0EN_MSK << IFX_CLOCK_OSCCON_X2CAP0EN_OFF) |\
        (IFX_CLOCK_OSCCON_X2CAP1EN_MSK << IFX_CLOCK_OSCCON_X2CAP1EN_OFF) |\
        (IFX_CLOCK_OSCCON_X2CAP2EN_MSK << IFX_CLOCK_OSCCON_X2CAP2EN_OFF) |\
        (IFX_CLOCK_OSCCON_X2CAP3EN_MSK << IFX_CLOCK_OSCCON_X2CAP3EN_OFF) )

#define IFXCLOCK_CFG_OSCCON_VALUE \
    (uint32)( \
        (IFX_CLOCK_OSCCON_HYSEN_VAL << IFX_CLOCK_OSCCON_HYSEN_OFF) | \
        (IFX_CLOCK_OSCCON_X1CAP0EN_VAL << IFX_CLOCK_OSCCON_X1CAP0EN_OFF) |\
        (IFX_CLOCK_OSCCON_X1CAP1EN_VAL << IFX_CLOCK_OSCCON_X1CAP1EN_OFF) |\
        (IFX_CLOCK_OSCCON_X1CAP2EN_VAL << IFX_CLOCK_OSCCON_X1CAP2EN_OFF) |\
        (IFX_CLOCK_OSCCON_X1CAP3EN_VAL << IFX_CLOCK_OSCCON_X1CAP3EN_OFF) |\
        (IFX_CLOCK_OSCCON_X2CAP0EN_VAL << IFX_CLOCK_OSCCON_X2CAP0EN_OFF) |\
        (IFX_CLOCK_OSCCON_X2CAP1EN_VAL << IFX_CLOCK_OSCCON_X2CAP1EN_OFF) |\
        (IFX_CLOCK_OSCCON_X2CAP2EN_VAL << IFX_CLOCK_OSCCON_X2CAP2EN_OFF) |\
        (IFX_CLOCK_OSCCON_X2CAP3EN_VAL << IFX_CLOCK_OSCCON_X2CAP3EN_OFF) )

/**************** Final OSCCON ******************/

#define IFXCLOCK_CFG_CLK_OSCCON                                                              \
    {                                                                                            \
/*      {   uint32 value,            uint32 mask                    }*/                          \
        IFXCLOCK_CFG_OSCCON_VALUE, IFXCLOCK_CFG_OSCCON_MASK   /*IFXCLOCKCcu_CcuconRegConfig SYSCCUCON0;*/ \
    }

/************************** SYSCCUCON0 **************************/
#define IFXCLOCK_CFG_SYSCCUCON0_MASK \
    (uint32)( \
        (IFX_CLOCK_SYSCCUCON0_SPBDIV_MSK << IFX_CLOCK_SYSCCUCON0_SPBDIV_OFF) | \
		(IFX_CLOCK_SYSCCUCON0_CPBDIV_MSK << IFX_CLOCK_SYSCCUCON0_CPBDIV_OFF) | \
        (IFX_CLOCK_SYSCCUCON0_TPBDIV_MSK << IFX_CLOCK_SYSCCUCON0_TPBDIV_OFF) | \
        (IFX_CLOCK_SYSCCUCON0_SRIDIV_MSK << IFX_CLOCK_SYSCCUCON0_SRIDIV_OFF) | \
        (IFX_CLOCK_SYSCCUCON0_FSIDIV_MSK << IFX_CLOCK_SYSCCUCON0_FSIDIV_OFF) | \
        (IFX_CLOCK_SYSCCUCON0_STMDIV_MSK << IFX_CLOCK_SYSCCUCON0_STMDIV_OFF) | \
        (IFX_CLOCK_SYSCCUCON0_SRICSDIV_MSK << IFX_CLOCK_SYSCCUCON0_SRICSDIV_OFF) )

#define IFXCLOCK_CFG_SYSCCUCON0_BASIC_(pll0Freq, pll1Freq, pll2Freq) \
    (uint32)( \
        (IFXCLOCK_CFG_SPBDIV_##pll0Freq << IFX_CLOCK_SYSCCUCON0_SPBDIV_OFF) | \
		(IFXCLOCK_CFG_CPBDIV_##pll0Freq << IFX_CLOCK_SYSCCUCON0_CPBDIV_OFF) | \
        (IFXCLOCK_CFG_TPBDIV_##pll0Freq << IFX_CLOCK_SYSCCUCON0_TPBDIV_OFF) | \
        (IFXCLOCK_CFG_SRIDIV_##pll0Freq << IFX_CLOCK_SYSCCUCON0_SRIDIV_OFF) | \
        (IFXCLOCK_CFG_FSIDIV_##pll0Freq << IFX_CLOCK_SYSCCUCON0_FSIDIV_OFF) | \
        (IFXCLOCK_CFG_STMDIV_##pll0Freq << IFX_CLOCK_SYSCCUCON0_STMDIV_OFF) | \
        (IFXCLOCK_CFG_SRICSDIV_##pll0Freq << IFX_CLOCK_SYSCCUCON0_SRICSDIV_OFF))

#define IFXCLOCK_CFG_SYSCCUCON0_BASIC(pll0Freq, pll1Freq, pll2Freq) IFXCLOCK_CFG_SYSCCUCON0_BASIC_(pll0Freq, pll1Freq, pll2Freq)

#define IFXCLOCK_CFG_SYSCCUCON0 IFXCLOCK_CFG_SYSCCUCON0_BASIC(IFXCLOCK_CFG_SYSPLL_FREQ, IFXCLOCK_CFG_PERPLL1_FREQ, IFXCLOCK_CFG_PERPLL2_FREQ)

/************************** SYSCCUCON1 **************************/
#define IFXCLOCK_CFG_SYSCCUCON1_MASK \
    (uint32)( \
        (IFX_CLOCK_SYSCCUCON1_GETHDIV_MSK << IFX_CLOCK_SYSCCUCON1_GETHDIV_OFF) | \
        (IFX_CLOCK_SYSCCUCON1_MCANHDIV_MSK << IFX_CLOCK_SYSCCUCON1_MCANHDIV_OFF) | \
        (IFX_CLOCK_SYSCCUCON1_LETHDIV_MSK << IFX_CLOCK_SYSCCUCON1_LETHDIV_OFF) | \
        (IFX_CLOCK_SYSCCUCON1_CANXLHDIV_MSK << IFX_CLOCK_SYSCCUCON1_CANXLHDIV_OFF) | \
        (IFX_CLOCK_SYSCCUCON1_EGTMDIV_MSK << IFX_CLOCK_SYSCCUCON1_EGTMDIV_OFF) )

#define IFXCLOCK_CFG_SYSCCUCON1_BASIC_(pll0Freq, pll1Freq, pll2Freq) \
    (uint32)( \
        (IFXCLOCK_CFG_XGETH0DIV_##pll0Freq << IFX_CLOCK_SYSCCUCON1_GETHDIV_OFF) | \
        (IFXCLOCK_CFG_EGTMDIV_##pll0Freq << IFX_CLOCK_SYSCCUCON1_EGTMDIV_OFF) | \
        (IFXCLOCK_CFG_MCANHDIV_##pll0Freq << IFX_CLOCK_SYSCCUCON1_MCANHDIV_OFF) | \
		(IFXCLOCK_CFG_LETHDIV_##pll0Freq << IFX_CLOCK_SYSCCUCON1_LETHDIV_OFF) | \
        (IFXCLOCK_CFG_CANXLHDIV_##pll0Freq << IFX_CLOCK_SYSCCUCON1_CANXLHDIV_OFF) )

#define IFXCLOCK_CFG_SYSCCUCON1_BASIC(pll0Freq, pll1Freq, pll2Freq) IFXCLOCK_CFG_SYSCCUCON1_BASIC_(pll0Freq, pll1Freq, pll2Freq)

