yaswanth8872y/AURIX_code_examples/code_examples/iLLD_TC4D7_LK_ADS_QSPI_TLE9180D_2/Libraries/iLLD/TC4DA/CpuGeneric/_Impl/IfxClock_cfg.h
#define IFXCLOCK_CFG_SYSCCUCON1 IFXCLOCK_CFG_SYSCCUCON1_BASIC(IFXCLOCK_CFG_SYSPLL_FREQ, IFXCLOCK_CFG_PERPLL1_FREQ, IFXCLOCK_CFG_PERPLL2_FREQ)

/************************** PERCCUCON0 **************************/
#define IFXCLOCK_CFG_PERCCUCON0_MASK \
    (uint32)( \
        (IFX_CLOCK_PERCCUCON0_MCANDIV_MSK << IFX_CLOCK_PERCCUCON0_MCANDIV_OFF) | \
        (IFX_CLOCK_PERCCUCON0_CLKSELMCAN_MSK << IFX_CLOCK_PERCCUCON0_CLKSELMCAN_OFF) | \
        (IFX_CLOCK_PERCCUCON0_MSCDIV_MSK << IFX_CLOCK_PERCCUCON0_MSCDIV_OFF) | \
        (IFX_CLOCK_PERCCUCON0_CLKSELMSC_MSK << IFX_CLOCK_PERCCUCON0_CLKSELMSC_OFF) | \
        (IFX_CLOCK_PERCCUCON0_I2CDIV_MSK << IFX_CLOCK_PERCCUCON0_I2CDIV_OFF) | \
        (IFX_CLOCK_PERCCUCON0_QSPIDIV_MSK << IFX_CLOCK_PERCCUCON0_QSPIDIV_OFF) | \
        (IFX_CLOCK_PERCCUCON0_CLKSELQSPI_MSK << IFX_CLOCK_PERCCUCON0_CLKSELQSPI_OFF) | \
        (IFX_CLOCK_PERCCUCON0_PPUDIV_MSK << IFX_CLOCK_PERCCUCON0_PPUDIV_OFF))

#define IFXCLOCK_CFG_PERCCUCON0_BASIC_(pll0Freq, pll1Freq, pll2Freq) \
    (uint32)( \
        (IFXCLOCK_CFG_MCANDIV_##pll1Freq##_##pll2Freq << IFX_CLOCK_PERCCUCON0_MCANDIV_OFF) | \
        (IFXCLOCK_CFG_CLKSELMCAN_##pll1Freq##_##pll2Freq << IFX_CLOCK_PERCCUCON0_CLKSELMCAN_OFF) | \
        (IFXCLOCK_CFG_MSCDIV_##pll1Freq##_##pll2Freq << IFX_CLOCK_PERCCUCON0_MSCDIV_OFF) | \
        (IFXCLOCK_CFG_CLKSELMSC_##pll1Freq##_##pll2Freq << IFX_CLOCK_PERCCUCON0_CLKSELMSC_OFF) | \
        (IFXCLOCK_CFG_I2CDIV_##pll1Freq##_##pll2Freq << IFX_CLOCK_PERCCUCON0_I2CDIV_OFF) | \
        (IFXCLOCK_CFG_QSPIDIV_##pll1Freq##_##pll2Freq << IFX_CLOCK_PERCCUCON0_QSPIDIV_OFF) | \
        (IFXCLOCK_CFG_CLKSELQSPI_##pll1Freq##_##pll2Freq << IFX_CLOCK_PERCCUCON0_CLKSELQSPI_OFF) | \
        (IFXCLOCK_CFG_PPUDIV_##pll1Freq##_##pll2Freq << IFX_CLOCK_PERCCUCON0_PPUDIV_OFF))

#define IFXCLOCK_CFG_PERCCUCON0_BASIC(pll0Freq, pll1Freq, pll2Freq) IFXCLOCK_CFG_PERCCUCON0_BASIC_(pll0Freq, pll1Freq, pll2Freq)

#define IFXCLOCK_CFG_PERCCUCON0 IFXCLOCK_CFG_PERCCUCON0_BASIC(IFXCLOCK_CFG_SYSPLL_FREQ, IFXCLOCK_CFG_PERPLL1_FREQ, IFXCLOCK_CFG_PERPLL2_FREQ)

/************************** PERCCUCON1 **************************/
#define IFXCLOCK_CFG_PERCCUCON1_MASK \
    (uint32)( \
        (IFX_CLOCK_PERCCUCON1_ASCLINFDIV_MSK << IFX_CLOCK_PERCCUCON1_ASCLINFDIV_OFF) | \
        (IFX_CLOCK_PERCCUCON1_ASCLINSDIV_MSK << IFX_CLOCK_PERCCUCON1_ASCLINSDIV_OFF) | \
        (IFX_CLOCK_PERCCUCON1_CLKSELASCLINS_MSK << IFX_CLOCK_PERCCUCON1_CLKSELASCLINS_OFF)| \
        (IFX_CLOCK_PERCCUCON1_CLKSELCANXL_MSK << IFX_CLOCK_PERCCUCON1_CLKSELCANXL_OFF)| \
        (IFX_CLOCK_PERCCUCON1_ADCPERON_MSK << IFX_CLOCK_PERCCUCON1_ADCPERON_OFF) | \
        (IFX_CLOCK_PERCCUCON1_XSPISLDIV_MSK << IFX_CLOCK_PERCCUCON1_XSPISLDIV_OFF) | \
        (IFX_CLOCK_PERCCUCON1_CANXLDIV_MSK << IFX_CLOCK_PERCCUCON1_CANXLDIV_OFF) | \
        (IFX_CLOCK_PERCCUCON1_ERAYPERON_MSK << IFX_CLOCK_PERCCUCON1_ERAYPERON_OFF) | \
        (IFX_CLOCK_PERCCUCON1_XSPIPERON_MSK << IFX_CLOCK_PERCCUCON1_XSPIPERON_OFF) | \
        (IFX_CLOCK_PERCCUCON1_SDMMCPERON_MSK << IFX_CLOCK_PERCCUCON1_SDMMCPERON_OFF) | \
        (IFX_CLOCK_PERCCUCON1_HSCTPERON_MSK << IFX_CLOCK_PERCCUCON1_HSCTPERON_OFF) | \
        (IFX_CLOCK_PERCCUCON1_LETH100PERON_MSK << IFX_CLOCK_PERCCUCON1_LETH100PERON_OFF))

#define IFXCLOCK_CFG_PERCCUCON1_BASIC_(pll0Freq, pll1Freq, pll2Freq) \
    (uint32)( \
        (IFXCLOCK_CFG_ASCLINFDIV_##pll1Freq##_##pll2Freq << IFX_CLOCK_PERCCUCON1_ASCLINFDIV_OFF) | \
        (IFXCLOCK_CFG_ASCLINSDIV_##pll1Freq##_##pll2Freq << IFX_CLOCK_PERCCUCON1_ASCLINSDIV_OFF) | \
        (IFXCLOCK_CFG_CLKSELASCLINS_##pll1Freq##_##pll2Freq << IFX_CLOCK_PERCCUCON1_CLKSELASCLINS_OFF)| \
        (IFXCLOCK_CFG_CLKSELCANXL_##pll1Freq##_##pll2Freq << IFX_CLOCK_PERCCUCON1_CLKSELCANXL_OFF)| \
        (IFXCLOCK_CFG_ADC_PERON << IFX_CLOCK_PERCCUCON1_ADCPERON_OFF)| \
        (IFXCLOCK_CFG_XSPISLDIV_##pll1Freq##_##pll2Freq << IFX_CLOCK_PERCCUCON1_XSPISLDIV_OFF)| \
        (IFXCLOCK_CFG_CANXLDIV_##pll1Freq##_##pll2Freq << IFX_CLOCK_PERCCUCON1_CANXLDIV_OFF)| \
        (IFXCLOCK_CFG_LETH100PERON << IFX_CLOCK_PERCCUCON1_LETH100PERON_OFF)| \
        (IFXCLOCK_CFG_XSPI_PERON << IFX_CLOCK_PERCCUCON1_XSPIPERON_OFF)| \
        (IFXCLOCK_CFG_ERAY_PERON << IFX_CLOCK_PERCCUCON1_ERAYPERON_OFF)| \
        (IFXCLOCK_CFG_SDMMC_PERON << IFX_CLOCK_PERCCUCON1_SDMMCPERON_OFF)| \
        (IFXCLOCK_CFG_HSCT_PERON << IFX_CLOCK_PERCCUCON1_HSCTPERON_OFF))


#define IFXCLOCK_CFG_PERCCUCON1_BASIC(pll0Freq, pll1Freq, pll2Freq) IFXCLOCK_CFG_PERCCUCON1_BASIC_(pll0Freq, pll1Freq, pll2Freq)

#define IFXCLOCK_CFG_PERCCUCON1 IFXCLOCK_CFG_PERCCUCON1_BASIC(IFXCLOCK_CFG_SYSPLL_FREQ, IFXCLOCK_CFG_PERPLL1_FREQ, IFXCLOCK_CFG_PERPLL2_FREQ)


/**************** Final Clock Distribution ******************/

#define IFXCLOCK_CFG_CLK_DISTRIBUTION                                                              \
    {                                                                                            \
/*      {   uint32 value,            uint32 mask                    }*/                          \
        {IFXCLOCK_CFG_SYSCCUCON0, IFXCLOCK_CFG_SYSCCUCON0_MASK},   /*IFXCLOCKCcu_CcuconRegConfig SYSCCUCON0;*/  \
        {IFXCLOCK_CFG_SYSCCUCON1, IFXCLOCK_CFG_SYSCCUCON1_MASK},   /*IFXCLOCKCcu_CcuconRegConfig SYSCCUCON1;*/  \
        {IFXCLOCK_CFG_PERCCUCON0, IFXCLOCK_CFG_PERCCUCON0_MASK},   /*IFXCLOCKCcu_CcuconRegConfig PERCCUCON0;*/  \
        {IFXCLOCK_CFG_PERCCUCON1, IFXCLOCK_CFG_PERCCUCON1_MASK},   /*IFXCLOCKCcu_CcuconRegConfig PERCCUCON1;*/  \
    }

/** \brief Macros to configure FLASH Wait states 
 * The values are configured as per the UM. The PFLASH wait state is based on fSRI 
 * and DLFASH wait state is based on fFSI.
 */

#ifndef IFXCLOCK_CFG_DFLASH_WAITSTATE_VAL
#define IFXCLOCK_CFG_DFLASH_WAITSTATE_VAL (5)
#endif

#ifndef IFXCLOCK_CFG_PFLASH_WAITSTATE_VAL
#define IFXCLOCK_CFG_PFLASH_WAITSTATE_VAL (8)
#endif

#define IFXCLOCK_CFG_FLASH_WAITSTATE       \
/*  {   uint16 dFlashWaitCycles,           uint16 pFlashWaitCycles                 }*/\
    {IFXCLOCK_CFG_DFLASH_WAITSTATE_VAL, IFXCLOCK_CFG_PFLASH_WAITSTATE_VAL}
/******************************************************************************/


/******************************************************************************/
/*                           Enum                                             */
/******************************************************************************/



/******************************************************************************/

#endif /* IFXCLOCK_CFG_H */

